dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R6 (0x06) - Mic Bias Control 0
 */
#define WM8904_R6_MIC_BIAS_CONTROL_0 WM8904_MIC_BIAS_CONTROL_0
#define WM8904_MICDET_THR_Pos 4 /* MICDET_THR - [6:4] */
#define WM8904_MICDET_THR_Msk 0x0070
#define WM8904_MICDET_THR(Value) (WM8904_MICDET_THR_Msk & ((Value) << WM8904_MICDET_THR_Pos))
#define WM8904_MICSHORT_THR_Pos 2 /* MICSHORT_THR - [3:2] */
#define WM8904_MICSHORT_THR_Msk 0x000C
#define WM8904_MICSHORT_THR(Value) (WM8904_MICSHORT_THR_Msk & ((Value) << WM8904_MICSHORT_THR_Pos))
#define WM8904_MICDET_ENA_Pos 1 /* MICDET_ENA */
#define WM8904_MICDET_ENA 0x002
#define WM8904_MICBIAS_ENA_Pos 0 /* MICBIAS_ENA */
#define WM8904_MICBIAS_ENA 0x0001

/*
 * R9 (0x07) - Mic Bias Control 1
 */
#define WM8904_R9_MIC_FILTER_CONTROL WM8904_MIC_FILTER_CONTROL
#define WM8904_MICBIAS_SEL_Pos 0 /* MICBIAS_SEL - [2:0] */
#define WM8904_MICBIAS_SEL_Msk 0x0007
#define WM8904_MICBIAS_SEL(Value) (WM8904_MICBIAS_SEL_Msk & ((Value) << WM8904_MICBIAS_SEL_Pos))

/*
 * R10 (0x0A) - Analogue ADC 0
 */
#define WM8904_R10_ANALOGUE_ADC_0 WM8904_ANALOGUE_ADC_0
#define WM8904_ADC_OSR128_Pos 0 /* ADC_OSR128 */
#define WM8904_ADC_OSR128 0x0001

/*
 * R12 (0x0C) - Power Management 0
 */
#define WM8904_R12_WM8904_POWER_MANAGEMENT_0 WM8904_POWER_MANAGEMENT_0
#define WM8904_INL_ENA_Pos 1 /* INL_ENA */
#define WM8904_INL_ENA 0x0002
#define WM8904_INR_ENA_Pos 0 /* INR_ENA */
#define WM8904_INR_ENA 0x0001

/*
 * R14 (0x0E) - Power Management 2
 */
#define WM8904_R14_WM8904_POWER_MANAGEMENT_2 WM8904_POWER_MANAGEMENT_2
#define WM8904_HPL_PGA_ENA_Pos 1 /* HPL_PGA_ENA */
#define WM8904_HPL_PGA_ENA 0x0002
#define WM8904_HPR_PGA_ENA_Pos 0 /* HPR_PGA_ENA */
#define WM8904_HPR_PGA_ENA 0x0001

/*
 * R15 (0x0F) - Power Management 3
 */
#define WM8904_R15_WM8904_POWER_MANAGEMENT_3 WM8904_POWER_MANAGEMENT_3
#define WM8904_LINEOUTL_PGA_ENA_Pos 1 /* LINEOUTL_PGA_ENA */
#define WM8904_LINEOUTL_PGA_ENA 0x0002
#define WM8904_LINEOUTR_PGA_ENA_Pos 0 /* LINEOUTR_PGA_ENA */
#define WM8904_LINEOUTR_PGA_ENA 0x0001

/*
 * R18 (0x12) - Power Management 6
 */
#define WM8904_R18_WM8904_POWER_MANAGEMENT_6 WM8904_POWER_MANAGEMENT_6
#define WM8904_DACL_ENA_Pos 3 /* DACL_ENA */
#define WM8904_DACL_ENA 0x0008
#define WM8904_DACR_ENA_Pos 2 /* DACR_ENA */
#define WM8904_DACR_ENA 0x0004
#define WM8904_ADCL_ENA_Pos 1 /* ADCL_ENA */
#define WM8904_ADCL_ENA 0x0002
#define WM8904_ADCR_ENA_Pos 0 /* ADCR_ENA */
#define WM8904_ADCR_ENA 0x0001

/*
 * R20 (0x14) - Clock Rates 0
 */
#define WM8904_R20_CLOCK_RATES_0 WM8904_CLOCK_RATES_0
#define WM8904_TOCLK_RATE_DIV16_Pos 14 /* TOCLK_RATE_DIV16 */
#define WM8904_TOCLK_RATE_DIV16 0x4000
#define WM8904_TOCLK_RATE_X4_Pos 13 /* TOCLK_RATE_X4 */
#define WM8904_TOCLK_RATE_X4 0x2000
#define WM8904_MCLK_DIV_Pos 0 /* MCLK_DIV */
#define WM8904_MCLK_DIV 0x0001

/*
 * R21 (0x15) - Clock Rates 1
 */
#define WM8904_R21_CLOCK_RATES_1 WM8904_CLOCK_RATES_1
#define WM8904_CLK_SYS_RATE_Pos 10 /* CLK_SYS_RATE - [13:10] */
#define WM8904_CLK_SYS_RATE_Msk 0x3C00
#define WM8904_CLK_SYS_RATE(Value) (WM8904_CLK_SYS_RATE_Msk & ((Value) << WM8904_CLK_SYS_RATE_Pos))
#define WM8904_SAMPLE_RATE_Pos 0 /* SAMPLE_RATE - [2:0] */
#define WM8904_SAMPLE_RATE_Msk 0x0007
#define WM8904_SAMPLE_RATE(Value) (WM8904_SAMPLE_RATE_Msk & ((Value) << WM8904_SAMPLE_RATE_Pos))

/*
 * R22 (0x16) - Clock Rates 2
 */
#define WM8904_R22_CLOCK_RATES_2 WM8904_CLOCK_RATES_2
#define WM8904_MCLK_INV_Pos 15 /* MCLK_INV */
#define WM8904_MCLK_INV 0x8000
#define WM8904_SYSCLK_SRC_Pos 14 /* SYSCLK_SRC */
#define WM8904_SYSCLK_SRC 0x4000
#define WM8904_TOCLK_RATE_Pos 12 /* TOCLK_RATE */
#define WM8904_TOCLK_RATE 0x1000
#define WM8904_OPCLK_ENA_Pos 3 /* OPCLK_ENA */
#define WM8904_OPCLK_ENA 0x0008
#define WM8904_CLK_SYS_ENA_Pos 2 /* CLK_SYS_ENA */
#define WM8904_CLK_SYS_ENA 0x0004
#define WM8904_CLK_DSP_ENA_Pos 1 /* CLK_DSP_ENA */
#define WM8904_CLK_DSP_ENA 0x0002
#define WM8904_TOCLK_ENA_Pos 0 /* TOCLK_ENA */
#define WM8904_TOCLK_ENA 0x0001

/*
 * R24 (0x18) - Audio Interface 0
 */
#define WM8904_R24_AUDIO_INTERFACE_0 WM8904_AUDIO_INTERFACE_0
#define WM8904_DACL_DATINV_Pos 12 /* DACL_DATINV */
#define WM8904_DACL_DATINV 0x1000
#define WM8904_DACR_DATINV_Pos 11 /* DACR_DATINV */
#define WM8904_DACR_DATINV 0x0800
#define WM8904_DAC_BOOST_Pos 9 /* DAC_BOOST - [10:9] */
#define WM8904_DAC_BOOST_Msk 0x0600
#define WM8904_DAC_BOOST(Value) (WM8904_DAC_BOOST_Msk & ((Value) << WM8904_DAC_BOOST_Pos))
#define WM8904_LOOPBACK_Pos 8 /* LOOPBACK */
#define WM8904_LOOPBACK 0x0100
#define WM8904_AIFADCL_SRC_Pos 7 /* AIFADCL_SRC */
#define WM8904_AIFADCL_SRC 0x0080
#define WM8904_AIFADCR_SRC_Pos 6 /* AIFADCR_SRC */
#define WM8904_AIFADCR_SRC 0x0040
#define WM8904_AIFDACL_SRC_Pos 5 /* AIFDACL_SRC */
#define WM8904_AIFDACL_SRC 0x0020
#define WM8904_AIFDACR_SRC_Pos 4 /* AIFDACR_SRC */
#define WM8904_AIFDACR_SRC 0x0010
#define WM8904_ADC_COMP_Pos 3 /* ADC_COMP */
#define WM8904_ADC_COMP 0x0008
#define WM8904_ADC_COMPMODE_Pos 2 /* ADC_COMPMODE */
#define WM8904_ADC_COMPMODE 0x0004
#define WM8904_DAC_COMP_Pos 1 /* DAC_COMP */
#define WM8904_DAC_COMP 0x0002
#define WM8904_DAC_COMPMODE_Pos 0 /* DAC_COMPMODE */
#define WM8904_DAC_COMPMODE 0x0001

/*
 * R25 (0x19) - Audio Interface 1
 */
#define WM8904_R25_AUDIO_INTERFACE_1 WM8904_AUDIO_INTERFACE_1
#define WM8904_AIFDAC_TDM_Pos 13 /* AIFDAC_TDM */
#define WM8904_AIFDAC_TDM 0x2000
#define WM8904_AIFDAC_TDM_CHAN_Pos 12 /* AIFDAC_TDM_CHAN */
#define WM8904_AIFDAC_TDM_CHAN 0x1000
#define WM8904_AIFADC_TDM_Pos 11 /* AIFADC_TDM */
#define WM8904_AIFADC_TDM 0x0800
#define WM8904_AIFADC_TDM_CHAN_Pos 10 /* AIFADC_TDM_CHAN */
#define WM8904_AIFADC_TDM_CHAN 0x0400
#define WM8904_AIF_TRIS_Pos 8 /* AIF_TRIS */
#define WM8904_AIF_TRIS 0x0100
#define WM8904_AIF_BCLK_INV_Pos 7 /* AIF_BCLK_INV */
#define WM8904_AIF_BCLK_INV 0x0080
#define WM8904_BCLK_DIR_Pos 6 /* BCLK_DIR */
#define WM8904_BCLK_DIR 0x0040
#define WM8904_AIF_LRCLK_INV_Pos 4 /* AIF_LRCLK_INV */
#define WM8904_AIF_LRCLK_INV 0x0010
#define WM8904_AIF_WL_Pos 2 /* AIF_WL - [3:2] */
#define WM8904_AIF_WL_Msk 0x000C
#define WM8904_AIF_WL(Value) (WM8904_AIF_WL_Msk & ((Value) << WM8904_AIF_WL_Pos))
#define WM8904_AIF_WL_16BIT WM8904_AIF_WL(0)
#define WM8904_AIF_WL_20BIT WM8904_AIF_WL(1)
#define WM8904_AIF_WL_24BIT WM8904_AIF_WL(2)
#define WM8904_AIF_WL_32BIT WM8904_AIF_WL(3)
#define WM8904_AIF_FMT_Pos 0 /* AIF_FMT - [1:0] */
#define WM8904_AIF_FMT_Msk 0x0003
#define WM8904_AIF_FMT(Value) (WM8904_AIF_FMT_Msk & ((Value) << WM8904_AIF_FMT_Pos))
#define WM8904_AIF_FMT_RIGHT WM8904_AIF_FMT(0)
#define WM8904_AIF_FMT_LEFT WM8904_AIF_FMT(1)
#define WM8904_AIF_FMT_I2S WM8904_AIF_FMT(2)
#define WM8904_AIF_FMT_DSP WM8904_AIF_FMT(3)

