dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R26 (0x1A) - Audio Interface 2
 */
#define WM8904_R26_AUDIO_INTERFACE_2 WM8904_AUDIO_INTERFACE_2
#define WM8904_OPCLK_DIV_Pos 8 /* OPCLK_DIV - [11:8] */
#define WM8904_OPCLK_DIV_Msk 0x0F00
#define WM8904_OPCLK_DIV(Value) (WM8904_OPCLK_DIV_Msk & ((Value) << WM8904_OPCLK_DIV_Pos))
#define WM8904_BCLK_DIV_Pos 0 /* BCLK_DIV - [4:0] */
#define WM8904_BCLK_DIV_Msk 0x001F
#define WM8904_BCLK_DIV(Value) (WM8904_BCLK_DIV_Msk & ((Value) << WM8904_BCLK_DIV_Pos))

/*
 * R27 (0x1B) - Audio Interface 3
 */
#define WM8904_R27_AUDIO_INTERFACE_3 WM8904_AUDIO_INTERFACE_3
#define WM8904_LRCLK_DIR_Pos 11 /* LRCLK_DIR */
#define WM8904_LRCLK_DIR 0x0800
#define WM8904_LRCLK_RATE_Pos 0 /* LRCLK_RATE - [10:0] */
#define WM8904_LRCLK_RATE_Msk 0x07FF
#define WM8904_LRCLK_RATE(Value) (WM8904_LRCLK_RATE_Msk & ((Value) << WM8904_LRCLK_RATE_Pos))

/*
 * R30 (0x1E) - DAC Digital Volume Left
 */
#define WM8904_R30_DAC_DIGITAL_VOLUME_LEFT WM8904_DAC_DIGITAL_VOLUME_LEFT
#define WM8904_DAC_VU_Pos 8 /* DAC_VU */
#define WM8904_DAC_VU 0x0100
#define WM8904_DACL_VOL_Pos 0      /* DACL_VOL - [7:0] */
#define WM8904_DACL_VOL_Msk 0x00FF /* DACL_VOL - [7:0] */
#define WM8904_DACL_VOL(Value) (WM8904_DACL_VOL_Msk & ((Value) << WM8904_DACL_VOL_Pos))

/*
 * R31 (0x1F) - DAC Digital Volume Right
 */
#define WM8904_R31_DAC_DIGITAL_VOLUME_RIGHT WM8904_DAC_DIGITAL_VOLUME_RIGHT
#define WM8904_DAC_VU_Pos 8 /* DAC_VU */
#define WM8904_DAC_VU 0x0100
#define WM8904_DACR_VOL_Pos 0 /* DACR_VOL - [7:0] */
#define WM8904_DACR_VOL_Msk 0x00FF
#define WM8904_DACR_VOL(Value) (WM8904_DACR_VOL_Msk & ((Value) << WM8904_DACR_VOL_Pos))

/*
 * R32 (0x20) - DAC Digital 0
 */
#define WM8904_R32_DAC_DIGITAL_0 WM8904_DAC_DIGITAL_0
#define WM8904_ADCL_DAC_SVOL_Pos 8 /* ADCL_DAC_SVOL - [11:8] */
#define WM8904_ADCL_DAC_SVOL_Msk 0x0F00
#define WM8904_ADCL_DAC_SVOL(Value) (WM8904_ADCL_DAC_SVOL_Msk & ((Value) << WM8904_ADCL_DAC_SVOL_Pos))
#define WM8904_ADCR_DAC_SVOL_Pos 4 /* ADCR_DAC_SVOL - [7:4] */
#define WM8904_ADCR_DAC_SVOL_Msk 0x00F0
#define WM8904_ADCR_DAC_SVOL(Value) (WM8904_ADCR_DAC_SVOL_Msk & ((Value) << WM8904_ADCR_DAC_SVOL_Pos))
#define WM8904_ADC_TO_DACL_Pos 2 /* ADC_TO_DACL - [3:2] */
#define WM8904_ADC_TO_DACL_Msk 0x000C
#define WM8904_ADC_TO_DACL(Value) (WM8904_ADC_TO_DACL_Msk & ((Value) << WM8904_ADC_TO_DACL_Pos))
#define WM8904_ADC_TO_DACR_Pos 0 /* ADC_TO_DACR - [1:0] */
#define WM8904_ADC_TO_DACR_Msk 0x0003
#define WM8904_ADC_TO_DACR(Value) (WM8904_ADC_TO_DACR_Msk & ((Value) << WM8904_ADC_TO_DACR_Pos))

/*
 * R33 (0x21) - DAC Digital 1
 */
#define WM8904_R33_DAC_DIGITAL_1 WM8904_DAC_DIGITAL_1
#define WM8904_DAC_MONO_Pos 12 /* DAC_MONO */
#define WM8904_DAC_MONO 0x1000
#define WM8904_DAC_SB_FILT_Pos 11 /* DAC_SB_FILT */
#define WM8904_DAC_SB_FILT 0x0800
#define WM8904_DAC_MUTERATE_Pos 10 /* DAC_MUTERATE */
#define WM8904_DAC_MUTERATE 0x0400
#define WM8904_DAC_UNMUTE_RAMP_Pos 9 /* DAC_UNMUTE_RAMP */
#define WM8904_DAC_UNMUTE_RAMP 0x0200
#define WM8904_DAC_OSR128_Pos 6 /* DAC_OSR128 */
#define WM8904_DAC_OSR128 0x0040
#define WM8904_DAC_MUTE_Pos 3 /* DAC_MUTE */
#define WM8904_DAC_MUTE 0x0008
#define WM8904_DEEMPH_Pos 1 /* DEEMPH - [2:1] */
#define WM8904_DEEMPH_Msk 0x0006
#define WM8904_DEEMPH(Value) (WM8904_DEEMPH_Msk & ((Value) << WM8904_DEEMPH_Pos))

/*
 * R36 (0x24) - ADC Digital Volume Left
 */
#define WM8904_ADC_VU_Pos 8 /* ADC_VU */
#define WM8904_ADC_VU 0x0100
#define WM8904_ADCL_VOL_Pos 0 /* ADCL_VOL - [7:0] */
#define WM8904_ADCL_VOL_Msk 0x00FF
#define WM8904_ADCL_VOL(Value) (WM8904_ADCL_VOL_Msk & ((Value) << WM8904_ADCL_VOL_Pos))

/*
 * R37 (0x25) - ADC Digital Volume Right
 */
#define WM8904_ADC_VU_Pos 8 /* ADC_VU */
#define WM8904_ADC_VU 0x0100
#define WM8904_ADCR_VOL_Pos 0 /* ADCR_VOL - [7:0] */
#define WM8904_ADCR_VOL_Msk 0x00FF
#define WM8904_ADCR_VOL(Value) (WM8904_ADCR_VOL_Msk & ((Value) << WM8904_ADCR_VOL_Pos))

/*
 * R38 (0x26) - ADC Digital 0
 */
#define WM8904_ADC_HPF_CUT_Pos 5      /* ADC_HPF_CUT - [6:5] */
#define WM8904_ADC_HPF_CUT_Msk 0x0060 /* ADC_HPF_CUT - [6:5] */
#define WM8904_ADC_HPF_CUT(Value) (WM8904_ADC_HPF_CUT_Msk & ((Value) << WM8904_ADC_HPF_CUT_Pos))
#define WM8904_ADC_HPF_Pos 4 /* ADC_HPF */
#define WM8904_ADC_HPF 0x0010
#define WM8904_ADCL_DATINV_Pos 1 /* ADCL_DATINV */
#define WM8904_ADCL_DATINV 0x0002
#define WM8904_ADCR_DATINV_Pos 0 /* ADCR_DATINV */
#define WM8904_ADCR_DATINV 0x0001

/*
 * R39 (0x27) - Digital Microphone 0
 */
#define WM8904_DMIC_ENA_Pos 12 /* DMIC_ENA */
#define WM8904_DMIC_ENA 0x1000
#define WM8904_DMIC_SRC_Pos 11 /* DMIC_SRC */
#define WM8904_DMIC_SRC 0x0800

/*
 * R40 (0x28) - DRC 0
 */
#define WM8904_DRC_ENA_Pos 15 /* DRC_ENA */
#define WM8904_DRC_ENA 0x8000
#define WM8904_DRC_DAC_PATH_Pos 14 /* DRC_DAC_PATH */
#define WM8904_DRC_DAC_PATH 0x4000
#define WM8904_DRC_GS_HYST_LVL_Pos 11 /* DRC_GS_HYST_LVL - [12:11] */
#define WM8904_DRC_GS_HYST_LVL_Msk 0x1800
#define WM8904_DRC_GS_HYST_LVL(Value) (WM8904_DRC_GS_HYST_LVL_Msk & ((Value) << WM8904_DRC_GS_HYST_LVL_Pos))
#define WM8904_DRC_STARTUP_GAIN_Pos 6 /* DRC_STARTUP_GAIN - [10:6] */
#define WM8904_DRC_STARTUP_GAIN_Msk 0x07C0
#define WM8904_DRC_STARTUP_GAIN(Value) (WM8904_DRC_STARTUP_GAIN_Msk & ((Value) << WM8904_DRC_STARTUP_GAIN_Pos))
#define WM8904_DRC_FF_DELAY_Pos 5 /* DRC_FF_DELAY */
#define WM8904_DRC_FF_DELAY 0x0020
#define WM8904_DRC_GS_ENA_Pos 3 /* DRC_GS_ENA */
#define WM8904_DRC_GS_ENA 0x0008
#define WM8904_DRC_QR_Pos 2 /* DRC_QR */
#define WM8904_DRC_QR 0x0004
#define WM8904_DRC_ANTICLIP_Pos 1 /* DRC_ANTICLIP */
#define WM8904_DRC_ANTICLIP 0x0002
#define WM8904_DRC_GS_HYST_Pos 0 /* DRC_GS_HYST */
#define WM8904_DRC_GS_HYST 0x0001

/*
 * R41 (0x29) - DRC 1
 */
#define WM8904_DRC_ATK_Pos 12 /* DRC_ATK - [15:12] */
#define WM8904_DRC_ATK_Msk 0xF000
#define WM8904_DRC_ATK(Value) (WM8904_DRC_ATK_Msk & ((Value) << WM8904_DRC_ATK_Pos))
#define WM8904_DRC_DCY_Pos 8 /* DRC_DCY - [11:8] */
#define WM8904_DRC_DCY_Msk 0x0F00
#define WM8904_DRC_DCY(Value) (WM8904_DRC_DCY_Msk & ((Value) << WM8904_DRC_DCY_Pos))
#define WM8904_DRC_QR_THR_Pos 6 /* DRC_QR_THR - [7:6] */
#define WM8904_DRC_QR_THR_Msk 0x00C0
#define WM8904_DRC_QR_THR(Value) (WM8904_DRC_QR_THR_Msk & ((Value) << WM8904_DRC_QR_THR_Pos))
#define WM8904_DRC_QR_DCY_Pos 4 /* DRC_QR_DCY - [5:4] */
#define WM8904_DRC_QR_DCY_Msk 0x0030
#define WM8904_DRC_QR_DCY(Value) (WM8904_DRC_QR_DCY_Msk & ((Value) << WM8904_DRC_QR_DCY_Pos))
#define WM8904_DRC_MINGAIN_Pos 2 /* DRC_MINGAIN - [3:2] */
#define WM8904_DRC_MINGAIN_Msk 0x000C
#define WM8904_DRC_MINGAIN(Value) (WM8904_DRC_MINGAIN_Msk & ((Value) << WM8904_DRC_MINGAIN_Pos))
#define WM8904_DRC_MAXGAIN_Pos 0 /* DRC_MAXGAIN - [1:0] */
#define WM8904_DRC_MAXGAIN_Msk 0x0003
#define WM8904_DRC_MAXGAIN(Value) (WM8904_DRC_MAXGAIN_Msk & ((Value) << WM8904_DRC_MAXGAIN_Pos))

