dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R42 (0x2A) - DRC 2
 */
#define WM8904_DRC_HI_COMP_Pos 3 /* DRC_HI_COMP - [5:3] */
#define WM8904_DRC_HI_COMP_Msk 0x0038
#define WM8904_DRC_HI_COMP(Value) (WM8904_DRC_HI_COMP_Msk & ((Value) << WM8904_DRC_HI_COMP_Pos))
#define WM8904_DRC_LO_COMP_Pos 0 /* DRC_LO_COMP - [2:0] */
#define WM8904_DRC_LO_COMP_Msk 0x0007
#define WM8904_DRC_LO_COMP(Value) (WM8904_DRC_LO_COMP_Msk & ((Value) << WM8904_DRC_LO_COMP_Pos))

/*
 * R43 (0x2B) - DRC 3
 */
#define WM8904_DRC_KNEE_IP_Pos 5 /* DRC_KNEE_IP - [10:5] */
#define WM8904_DRC_KNEE_IP_Msk 0x07E0
#define WM8904_DRC_KNEE_IP(Value) (WM8904_DRC_KNEE_IP_Msk & ((Value) << WM8904_DRC_KNEE_IP_Pos))
#define WM8904_DRC_KNEE_OP_Pos 0 /* DRC_KNEE_OP - [4:0] */
#define WM8904_DRC_KNEE_OP_Msk 0x001F
#define WM8904_DRC_KNEE_OP(Value) (WM8904_DRC_KNEE_OP_Msk & ((Value) << WM8904_DRC_KNEE_OP_Pos))

/*
 * R44 (0x2C) - Analogue Left Input 0
 */
#define WM8904_LINMUTE_Pos 7 /* LINMUTE */
#define WM8904_LINMUTE 0x0080
#define WM8904_LIN_VOL_Pos 0 /* LIN_VOL - [4:0] */
#define WM8904_LIN_VOL_Msk 0x001F
#define WM8904_LIN_VOL(Value) (WM8904_LIN_VOL_Msk & ((Value) << WM8904_LIN_VOL_Pos))

/*
 * R45 (0x2D) - Analogue Right Input 0
 */
#define WM8904_RINMUTE_Pos 7 /* RINMUTE */
#define WM8904_RINMUTE 0x0080
#define WM8904_RIN_VOL_Pos 0 /* RIN_VOL - [4:0] */
#define WM8904_RIN_VOL_Msk 0x001F
#define WM8904_RIN_VOL(Value) (WM8904_RIN_VOL_Msk & ((Value) << WM8904_RIN_VOL_Pos))

/*
 * R46 (0x2E) - Analogue Left Input 1
 */
#define WM8904_INL_CM_ENA_Pos 6 /* INL_CM_ENA */
#define WM8904_INL_CM_ENA 0x0040
#define WM8904_L_IP_SEL_N_Pos 4 /* L_IP_SEL_N - [5:4] */
#define WM8904_L_IP_SEL_N_Msk 0x0030
#define WM8904_L_IP_SEL_N(Value) (WM8904_L_IP_SEL_N_Msk & ((Value) << WM8904_L_IP_SEL_N_Pos))
#define WM8904_L_IP_SEL_N_IN1L WM8904_L_IP_SEL_N(0)
#define WM8904_L_IP_SEL_N_IN2L WM8904_L_IP_SEL_N(1)
#define WM8904_L_IP_SEL_N_IN3L WM8904_L_IP_SEL_N(2)
#define WM8904_L_IP_SEL_P_Pos 2 /* L_IP_SEL_P - [3:2] */
#define WM8904_L_IP_SEL_P_Msk 0x000C
#define WM8904_L_IP_SEL_P(Value) (WM8904_L_IP_SEL_P_Msk & ((Value) << WM8904_L_IP_SEL_P_Pos))
#define WM8904_L_IP_SEL_P_IN1L WM8904_L_IP_SEL_P(0)
#define WM8904_L_IP_SEL_P_IN2L WM8904_L_IP_SEL_P(1)
#define WM8904_L_IP_SEL_P_IN3L WM8904_L_IP_SEL_P(2)
#define WM8904_L_MODE_Pos 0 /* L_MODE - [1:0] */
#define WM8904_L_MODE_Msk 0x0003
#define WM8904_L_MODE(Value) (WM8904_L_MODE_Msk & ((Value) << WM8904_L_MODE_Pos))
#define WM8904_L_MODE_SINGLE_ENDED WM8904_L_MODE(0)
#define WM8904_L_MODE_DIFF_LINE WM8904_L_MODE(1)
#define WM8904_L_MODE_DIFF_MIC WM8904_L_MODE(2)

/*
 * R47 (0x2F) - Analogue Right Input 1
 */
#define WM8904_INR_CM_ENA_Pos 6 /* INR_CM_ENA */
#define WM8904_INR_CM_ENA 0x0040
#define WM8904_R_IP_SEL_N_Pos 4 /* R_IP_SEL_N - [5:4] */
#define WM8904_R_IP_SEL_N_Msk 0x0030
#define WM8904_R_IP_SEL_N(Value) (WM8904_R_IP_SEL_N_Msk & ((Value) << WM8904_R_IP_SEL_N_Pos))
#define WM8904_R_IP_SEL_N_IN1L WM8904_R_IP_SEL_N(0)
#define WM8904_R_IP_SEL_N_IN2L WM8904_R_IP_SEL_N(1)
#define WM8904_R_IP_SEL_N_IN3L WM8904_R_IP_SEL_N(2)
#define WM8904_R_IP_SEL_P_Pos 2 /* R_IP_SEL_P - [3:2] */
#define WM8904_R_IP_SEL_P_Msk 0x000C
#define WM8904_R_IP_SEL_P(Value) (WM8904_R_IP_SEL_P_Msk & ((Value) << WM8904_R_IP_SEL_P_Pos))
#define WM8904_R_IP_SEL_P_IN1L WM8904_R_IP_SEL_P(0)
#define WM8904_R_IP_SEL_P_IN2L WM8904_R_IP_SEL_P(1)
#define WM8904_R_IP_SEL_P_IN3L WM8904_R_IP_SEL_P(2)
#define WM8904_R_MODE_Pos 0 /* R_MODE - [1:0] */
#define WM8904_R_MODE_Msk 0x0003
#define WM8904_R_MODE(Value) (WM8904_R_MODE_Msk & ((Value) << WM8904_R_MODE_Pos))
#define WM8904_R_MODE_SINGLE_ENDED WM8904_R_MODE(0)
#define WM8904_R_MODE_DIFF_LINE WM8904_R_MODE(1)
#define WM8904_R_MODE_DIFF_MIC WM8904_R_MODE(2)

/*
 * R57 (0x39) - Analogue OUT1 Left
 */
#define WM8904_R57_ANALOGUE_OUT1_LEFT WM8904_ANALOGUE_OUT1_LEFT
#define WM8904_HPOUTL_MUTE_Pos 8 /* HPOUTL_MUTE */
#define WM8904_HPOUTL_MUTE 0x0100
#define WM8904_HPOUT_VU_Pos 7 /* HPOUT_VU */
#define WM8904_HPOUT_VU 0x0080
#define WM8904_HPOUTLZC_Pos 6 /* HPOUTLZC */
#define WM8904_HPOUTLZC 0x0040
#define WM8904_HPOUTL_VOL_Pos 0 /* HPOUTL_VOL - [5:0] */
#define WM8904_HPOUTL_VOL_Msk 0x003F
#define WM8904_HPOUTL_VOL(Value) (WM8904_HPOUTL_VOL_Msk & ((Value) << WM8904_HPOUTL_VOL_Pos))

/*
 * R58 (0x3A) - Analogue OUT1 Right
 */
#define WM8904_R58_ANALOGUE_OUT1_RIGHT WM8904_ANALOGUE_OUT1_RIGHT
#define WM8904_HPOUTR_MUTE_Pos 8 /* HPOUTR_MUTE */
#define WM8904_HPOUTR_MUTE 0x0100
#define WM8904_HPOUT_VU_Pos 7 /* HPOUT_VU */
#define WM8904_HPOUT_VU 0x0080
#define WM8904_HPOUTRZC_Pos 6 /* HPOUTRZC */
#define WM8904_HPOUTRZC 0x0040
#define WM8904_HPOUTR_VOL_Pos 0 /* HPOUTR_VOL - [5:0] */
#define WM8904_HPOUTR_VOL_Msk 0x003F
#define WM8904_HPOUTR_VOL(Value) (WM8904_HPOUTR_VOL_Msk & ((Value) << WM8904_HPOUTR_VOL_Pos))

/*
 * R59 (0x3B) - Analogue OUT2 Left
 */
#define WM8904_R59_ANALOGUE_OUT2_LEFT WM8904_ANALOGUE_OUT2_LEFT
#define WM8904_LINEOUTL_MUTE_Pos 8 /* LINEOUTL_MUTE */
#define WM8904_LINEOUTL_MUTE 0x0100
#define WM8904_LINEOUT_VU_Pos 7 /* LINEOUT_VU */
#define WM8904_LINEOUT_VU 0x0080
#define WM8904_LINEOUTLZC_Pos 6 /* LINEOUTLZC */
#define WM8904_LINEOUTLZC 0x0040
#define WM8904_LINEOUTL_VOL_Pos 0 /* LINEOUTL_VOL - [5:0] */
#define WM8904_LINEOUTL_VOL_Msk 0x003F
#define WM8904_LINEOUTL_VOL(Value) (WM8904_LINEOUTL_VOL_Msk & ((Value) << WM8904_LINEOUTL_VOL_Pos))

/*
 * R60 (0x3C) - Analogue OUT2 Right
 */
#define WM8904_R60_ANALOGUE_OUT2_RIGHT WM8904_ANALOGUE_OUT2_RIGHT
#define WM8904_LINEOUTR_MUTE_Pos 8 /* LINEOUTR_MUTE */
#define WM8904_LINEOUTR_MUTE 0x0100
#define WM8904_LINEOUT_VU_Pos 7 /* LINEOUT_VU */
#define WM8904_LINEOUT_VU 0x0080
#define WM8904_LINEOUTRZC_Pos 6 /* LINEOUTRZC */
#define WM8904_LINEOUTRZC 0x0040
#define WM8904_LINEOUTR_VOL_Pos 0 /* LINEOUTR_VOL - [5:0] */
#define WM8904_LINEOUTR_VOL_Msk 0x003F
#define WM8904_LINEOUTR_VOL(Value) (WM8904_LINEOUTR_VOL_Msk & ((Value) << WM8904_LINEOUTR_VOL_Pos))

/*
 * R61 (0x3D) - Analogue OUT12 ZC
 */
#define WM8904_HPL_BYP_ENA_Pos 3 /* HPL_BYP_ENA */
#define WM8904_HPL_BYP_ENA 0x0008
#define WM8904_HPR_BYP_ENA_Pos 2 /* HPR_BYP_ENA */
#define WM8904_HPR_BYP_ENA 0x0004
#define WM8904_LINEOUTL_BYP_ENA_Pos 1 /* LINEOUTL_BYP_ENA */
#define WM8904_LINEOUTL_BYP_ENA 0x0002
#define WM8904_LINEOUTR_BYP_ENA_Pos 0 /* LINEOUTR_BYP_ENA */
#define WM8904_LINEOUTR_BYP_ENA 0x0001

