dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R67 (0x43) - DC Servo 0
 */
#define WM8904_R67_DC_SERVO_0 WM8904_DC_SERVO_0
#define WM8904_DCS_ENA_CHAN_3_Pos 3 /* DCS_ENA_CHAN_3 */
#define WM8904_DCS_ENA_CHAN_3 0x0008
#define WM8904_DCS_ENA_CHAN_2_Pos 2 /* DCS_ENA_CHAN_2 */
#define WM8904_DCS_ENA_CHAN_2 0x0004
#define WM8904_DCS_ENA_CHAN_1_Pos 1 /* DCS_ENA_CHAN_1 */
#define WM8904_DCS_ENA_CHAN_1 0x0002
#define WM8904_DCS_ENA_CHAN_0_Pos 0 /* DCS_ENA_CHAN_0 */
#define WM8904_DCS_ENA_CHAN_0 0x0001

/*
 * R68 (0x44) - DC Servo 1
 */
#define WM8904_R68_DC_SERVO_1 WM8904_DC_SERVO_1
#define WM8904_DCS_TRIG_SINGLE_3_Pos 15 /* DCS_TRIG_SINGLE_3 */
#define WM8904_DCS_TRIG_SINGLE_3 0x8000
#define WM8904_DCS_TRIG_SINGLE_2_Pos 14 /* DCS_TRIG_SINGLE_2 */
#define WM8904_DCS_TRIG_SINGLE_2 0x4000
#define WM8904_DCS_TRIG_SINGLE_1_Pos 13 /* DCS_TRIG_SINGLE_1 */
#define WM8904_DCS_TRIG_SINGLE_1 0x2000
#define WM8904_DCS_TRIG_SINGLE_0_Pos 12 /* DCS_TRIG_SINGLE_0 */
#define WM8904_DCS_TRIG_SINGLE_0 0x1000
#define WM8904_DCS_TRIG_SERIES_3_Pos 11 /* DCS_TRIG_SERIES_3 */
#define WM8904_DCS_TRIG_SERIES_3 0x0800
#define WM8904_DCS_TRIG_SERIES_2_Pos 10 /* DCS_TRIG_SERIES_2 */
#define WM8904_DCS_TRIG_SERIES_2 0x0400
#define WM8904_DCS_TRIG_SERIES_1_Pos 9 /* DCS_TRIG_SERIES_1 */
#define WM8904_DCS_TRIG_SERIES_1 0x0200
#define WM8904_DCS_TRIG_SERIES_0_Pos 8 /* DCS_TRIG_SERIES_0 */
#define WM8904_DCS_TRIG_SERIES_0 0x0100
#define WM8904_DCS_TRIG_STARTUP_3_Pos 7 /* DCS_TRIG_STARTUP_3 */
#define WM8904_DCS_TRIG_STARTUP_3 0x0080
#define WM8904_DCS_TRIG_STARTUP_2_Pos 6 /* DCS_TRIG_STARTUP_2 */
#define WM8904_DCS_TRIG_STARTUP_2 0x0040
#define WM8904_DCS_TRIG_STARTUP_1_Pos 5 /* DCS_TRIG_STARTUP_1 */
#define WM8904_DCS_TRIG_STARTUP_1 0x0020
#define WM8904_DCS_TRIG_STARTUP_0_Pos 4 /* DCS_TRIG_STARTUP_0 */
#define WM8904_DCS_TRIG_STARTUP_0 0x0010
#define WM8904_DCS_TRIG_DAC_WR_3_Pos 3 /* DCS_TRIG_DAC_WR_3 */
#define WM8904_DCS_TRIG_DAC_WR_3 0x0008
#define WM8904_DCS_TRIG_DAC_WR_2_Pos 2 /* DCS_TRIG_DAC_WR_2 */
#define WM8904_DCS_TRIG_DAC_WR_2 0x0004
#define WM8904_DCS_TRIG_DAC_WR_1_Pos 1 /* DCS_TRIG_DAC_WR_1 */
#define WM8904_DCS_TRIG_DAC_WR_1 0x0002
#define WM8904_DCS_TRIG_DAC_WR_0_Pos 0 /* DCS_TRIG_DAC_WR_0 */
#define WM8904_DCS_TRIG_DAC_WR_0 0x0001

/*
 * R69 (0x45) - DC Servo 2
 */
#define WM8904_R69_DC_SERVO_2 WM8904_DC_SERVO_2
#define WM8904_DCS_TIMER_PERIOD_23_Pos 8 /* DCS_TIMER_PERIOD_23 - [11:8] */
#define WM8904_DCS_TIMER_PERIOD_23_Msk 0x0F00
#define WM8904_DCS_TIMER_PERIOD_23(Value) (WM8904_DCS_TIMER_PERIOD_23_Msk & ((Value) << WM8904_DCS_TIMER_PERIOD_23_Pos))
#define WM8904_DCS_TIMER_PERIOD_01_Pos 0 /* DCS_TIMER_PERIOD_01 - [3:0] */
#define WM8904_DCS_TIMER_PERIOD_01_Msk 0x000F
#define WM8904_DCS_TIMER_PERIOD_01(Value) (WM8904_DCS_TIMER_PERIOD_01_Msk & ((Value) << WM8904_DCS_TIMER_PERIOD_01_Pos))

/*
 * R71 (0x47) - DC Servo 4
 */
#define WM8904_R71_DC_SERVO_4 WM8904_DC_SERVO_4
#define WM8904_DCS_SERIES_NO_23_Pos 0 /* DCS_SERIES_NO_23 - [6:0] */
#define WM8904_DCS_SERIES_NO_23_Msk 0x007F
#define WM8904_DCS_SERIES_NO_23(Value) (WM8904_DCS_SERIES_NO_23_Msk & ((Value) << WM8904_DCS_SERIES_NO_23_Pos))

/*
 * R72 (0x48) - DC Servo 5
 */
#define WM8904_R72_DC_SERVO_5 WM8904_DC_SERVO_5
#define WM8904_DCS_SERIES_NO_01_Pos 0 /* DCS_SERIES_NO_01 - [6:0] */
#define WM8904_DCS_SERIES_NO_01_Msk 0x007F
#define WM8904_DCS_SERIES_NO_01(Value) (WM8904_DCS_SERIES_NO_01_Msk & ((Value) << WM8904_DCS_SERIES_NO_01_Pos))

/*
 * R73 (0x49) - DC Servo 6
 */
#define WM8904_R73_DC_SERVO_6 WM8904_DC_SERVO_6
#define WM8904_DCS_DAC_WR_VAL_3_Pos 0 /* DCS_DAC_WR_VAL_3 - [7:0] */
#define WM8904_DCS_DAC_WR_VAL_3_Msk 0x00FF
#define WM8904_DCS_DAC_WR_VAL_3(Value) (WM8904_DCS_DAC_WR_VAL_3_Msk & ((Value) << WM8904_DCS_DAC_WR_VAL_3_Pos))

/*
 * R74 (0x4A) - DC Servo 7
 */
#define WM8904_R74_DC_SERVO_7 WM8904_DC_SERVO_7
#define WM8904_DCS_DAC_WR_VAL_2_Pos 0 /* DCS_DAC_WR_VAL_2 - [7:0] */
#define WM8904_DCS_DAC_WR_VAL_2_Msk 0x00FF
#define WM8904_DCS_DAC_WR_VAL_2(Value) (WM8904_DCS_DAC_WR_VAL_2_Msk & ((Value) << WM8904_DCS_DAC_WR_VAL_2_Pos))

/*
 * R75 (0x4B) - DC Servo 8
 */
#define WM8904_R75_DC_SERVO_8 WM8904_DC_SERVO_8
#define WM8904_DCS_DAC_WR_VAL_1_Pos 0 /* DCS_DAC_WR_VAL_1 - [7:0] */
#define WM8904_DCS_DAC_WR_VAL_1_Msk 0x00FF
#define WM8904_DCS_DAC_WR_VAL_1(Value) (WM8904_DCS_DAC_WR_VAL_1_Msk & ((Value) << WM8904_DCS_DAC_WR_VAL_1_Pos))

/*
 * R76 (0x4C) - DC Servo 9
 */
#define WM8904_R76_DC_SERVO_9 WM8904_DC_SERVO_9
#define WM8904_DCS_DAC_WR_VAL_0_Pos 0 /* DCS_DAC_WR_VAL_0 - [7:0] */
#define WM8904_DCS_DAC_WR_VAL_0_Msk 0x00FF
#define WM8904_DCS_DAC_WR_VAL_0(Value) (WM8904_DCS_DAC_WR_VAL_0_Msk & ((Value) << WM8904_DCS_DAC_WR_VAL_0_Pos))

/*
 * R77 (0x4D) - DC Servo Readback 0
 */
#define WM8904_DCS_CAL_COMPLETE_Pos 8 /* DCS_CAL_COMPLETE - [11:8] */
#define WM8904_DCS_CAL_COMPLETE_Msk 0x0F00
#define WM8904_DCS_CAL_COMPLETE(Value) (WM8904_DCS_CAL_COMPLETE_Msk & ((Value) << WM8904_DCS_CAL_COMPLETE_Pos))
#define WM8904_DCS_DAC_WR_COMPLETE_Pos 4 /* DCS_DAC_WR_COMPLETE - [7:4] */
#define WM8904_DCS_DAC_WR_COMPLETE_Msk 0x00F0
#define WM8904_DCS_DAC_WR_COMPLETE(Value) (WM8904_DCS_DAC_WR_COMPLETE_Msk & ((Value) << WM8904_DCS_DAC_WR_COMPLETE_Pos))
#define WM8904_DCS_STARTUP_COMPLETE_Pos 0 /* DCS_STARTUP_COMPLETE - [3:0] */
#define WM8904_DCS_STARTUP_COMPLETE_Msk 0x000F
#define WM8904_DCS_STARTUP_COMPLETE(Value) (WM8904_DCS_STARTUP_COMPLETE_Msk & ((Value) << WM8904_DCS_STARTUP_COMPLETE_Pos))

/*
 * R90 (0x5A) - Analogue HP 0
 */
#define WM8904_R90_WM8904_ANALOGUE_HP_0 WM8904_ANALOGUE_HP_0
#define WM8904_HPL_RMV_SHORT_Pos 7 /* HPL_RMV_SHORT */
#define WM8904_HPL_RMV_SHORT 0x0080
#define WM8904_HPL_ENA_OUTP_Pos 6 /* HPL_ENA_OUTP */
#define WM8904_HPL_ENA_OUTP 0x0040
#define WM8904_HPL_ENA_DLY_Pos 5 /* HPL_ENA_DLY */
#define WM8904_HPL_ENA_DLY 0x0020
#define WM8904_HPL_ENA_Pos 4 /* HPL_ENA */
#define WM8904_HPL_ENA 0x0010
#define WM8904_HPR_RMV_SHORT_Pos 3 /* HPR_RMV_SHORT */
#define WM8904_HPR_RMV_SHORT 0x0008
#define WM8904_HPR_ENA_OUTP_Pos 2 /* HPR_ENA_OUTP */
#define WM8904_HPR_ENA_OUTP 0x0004
#define WM8904_HPR_ENA_DLY_Pos 1 /* HPR_ENA_DLY */
#define WM8904_HPR_ENA_DLY 0x0002
#define WM8904_HPR_ENA_Pos 0 /* HPR_ENA */
#define WM8904_HPR_ENA 0x0001

