dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R94 (0x5E) - Analogue Lineout 0
 */
#define WM8904_R94_WM8904_ANALOGUE_LINEOUT_0 WM8904_ANALOGUE_LINEOUT_0
#define WM8904_LINEOUTL_RMV_SHORT_Pos 7 /* LINEOUTL_RMV_SHORT */
#define WM8904_LINEOUTL_RMV_SHORT 0x0080
#define WM8904_LINEOUTL_ENA_OUTP_Pos 6 /* LINEOUTL_ENA_OUTP */
#define WM8904_LINEOUTL_ENA_OUTP 0x0040
#define WM8904_LINEOUTL_ENA_DLY_Pos 5 /* LINEOUTL_ENA_DLY */
#define WM8904_LINEOUTL_ENA_DLY 0x0020
#define WM8904_LINEOUTL_ENA_Pos 4 /* LINEOUTL_ENA */
#define WM8904_LINEOUTL_ENA 0x0010
#define WM8904_LINEOUTR_RMV_SHORT_Pos 3 /* LINEOUTR_RMV_SHORT */
#define WM8904_LINEOUTR_RMV_SHORT 0x0008
#define WM8904_LINEOUTR_ENA_OUTP_Pos 2 /* LINEOUTR_ENA_OUTP */
#define WM8904_LINEOUTR_ENA_OUTP 0x0004
#define WM8904_LINEOUTR_ENA_DLY_Pos 1 /* LINEOUTR_ENA_DLY */
#define WM8904_LINEOUTR_ENA_DLY 0x0002
#define WM8904_LINEOUTR_ENA_Pos 0 /* LINEOUTR_ENA */
#define WM8904_LINEOUTR_ENA 0x0001

/*
 * R98 (0x62) - Charge Pump 0
 */
#define WM8904_CP_ENA_Pos 0 /* CP_ENA */
#define WM8904_CP_ENA 0x0001

/*
 * R104 (0x68) - Class W 0
 */
#define WM8904_CP_DYN_PWR_Pos 0 /* CP_DYN_PWR */
#define WM8904_CP_DYN_PWR 0x0001

/*
 * R108 (0x6C) - Write Sequencer 0
 */
#define WM8904_R108_WM8904_WRITE_SEQUENCER_0 WM8904_WRITE_SEQUENCER_0
#define WM8904_WSEQ_ENA_Pos 8 /* WSEQ_ENA */
#define WM8904_WSEQ_ENA 0x0100
#define WM8904_WSEQ_WRITE_INDEX_Pos 0 /* WSEQ_WRITE_INDEX - [4:0] */
#define WM8904_WSEQ_WRITE_INDEX_Msk 0x001F
#define WM8904_WSEQ_WRITE_INDEX(Value) (WM8904_WSEQ_WRITE_INDEX_Msk & ((Value) << WM8904_WSEQ_WRITE_INDEX_Pos))

/*
 * R109 (0x6D) - Write Sequencer 1
 */
#define WM8904_R109_WM8904_WRITE_SEQUENCER_1 WM8904_WRITE_SEQUENCER_1
#define WM8904_WSEQ_DATA_WIDTH_Pos 12 /* WSEQ_DATA_WIDTH - [14:12] */
#define WM8904_WSEQ_DATA_WIDTH_Msk 0x7000
#define WM8904_WSEQ_DATA_WIDTH(Value) (WM8904_WSEQ_DATA_WIDTH_Msk & ((Value) << WM8904_WSEQ_DATA_WIDTH_Pos))
#define WM8904_WSEQ_DATA_START_Pos 8 /* WSEQ_DATA_START - [11:8] */
#define WM8904_WSEQ_DATA_START_Msk 0x0F00
#define WM8904_WSEQ_DATA_START(Value) (WM8904_WSEQ_DATA_START_Msk & ((Value) << WM8904_WSEQ_DATA_START_Pos))
#define WM8904_WSEQ_ADDR_Pos 0 /* WSEQ_ADDR - [7:0] */
#define WM8904_WSEQ_ADDR_Msk 0x00FF
#define WM8904_WSEQ_ADDR(Value) (WM8904_WSEQ_ADDR_Msk & ((Value) << WM8904_WSEQ_ADDR_Pos))

/*
 * R110 (0x6E) - Write Sequencer 2
 */
#define WM8904_R110_WM8904_WRITE_SEQUENCER_2 WM8904_WRITE_SEQUENCER_2
#define WM8904_WSEQ_EOS_Pos 14 /* WSEQ_EOS */
#define WM8904_WSEQ_EOS 0x4000
#define WM8904_WSEQ_DELAY_Pos 8 /* WSEQ_DELAY - [11:8] */
#define WM8904_WSEQ_DELAY_Msk 0x0F00
#define WM8904_WSEQ_DELAY(Value) (WM8904_WSEQ_DELAY_Msk & ((Value) << WM8904_WSEQ_DELAY_Pos))
#define WM8904_WSEQ_DATA_Pos 0 /* WSEQ_DATA - [7:0] */
#define WM8904_WSEQ_DATA_Msk 0x00FF
#define WM8904_WSEQ_DATA(Value) (WM8904_WSEQ_DATA_Msk & ((Value) << WM8904_WSEQ_DATA_Pos))

/*
 * R111 (0x6F) - Write Sequencer 3
 */
#define WM8904_R111_WM8904_WRITE_SEQUENCER_3 WM8904_WRITE_SEQUENCER_3
#define WM8904_WSEQ_ABORT_Pos 9 /* WSEQ_ABORT */
#define WM8904_WSEQ_ABORT 0x0200
#define WM8904_WSEQ_START_Pos 8 /* WSEQ_START */
#define WM8904_WSEQ_START 0x0100
#define WM8904_WSEQ_START_INDEX_Pos 0 /* WSEQ_START_INDEX - [5:0] */
#define WM8904_WSEQ_START_INDEX_Msk 0x003F
#define WM8904_WSEQ_START_INDEX(Value) (WM8904_WSEQ_START_INDEX_Msk & ((Value) << WM8904_WSEQ_START_INDEX_Pos))

/*
 * R112 (0x70) - Write Sequencer 4
 */
#define WM8904_R112_WM8904_WRITE_SEQUENCER_4 WM8904_WRITE_SEQUENCER_4
#define WM8904_WSEQ_CURRENT_INDEX_Pos 4 /* WSEQ_CURRENT_INDEX - [9:4] */
#define WM8904_WSEQ_CURRENT_INDEX_Msk 0x03F0
#define WM8904_WSEQ_CURRENT_INDEX(Value) (WM8904_WSEQ_CURRENT_INDEX_Msk & ((Value) << WM8904_WSEQ_CURRENT_INDEX_Pos))
#define WM8904_WSEQ_BUSY_Pos 0 /* WSEQ_BUSY */
#define WM8904_WSEQ_BUSY 0x0001

/*
 * R116 (0x74) - FLL Control 1
 */
#define WM8904_R116_FLL_CONTROL_1 WM8904_FLL_CONTROL_1
#define WM8904_FLL_FRACN_ENA_Pos 2 /* FLL_FRACN_ENA */
#define WM8904_FLL_FRACN_ENA 0x0004
#define WM8904_FLL_OSC_ENA_Pos 1 /* FLL_OSC_ENA */
#define WM8904_FLL_OSC_ENA 0x0002
#define WM8904_FLL_ENA_Pos 0 /* FLL_ENA */
#define WM8904_FLL_ENA 0x0001

/*
 * R117 (0x75) - FLL Control 2
 */
#define WM8904_R117_FLL_CONTROL_2 WM8904_FLL_CONTROL_2
#define WM8904_FLL_OUTDIV_Pos 8 /* FLL_OUTDIV - [13:8] */
#define WM8904_FLL_OUTDIV_Msk 0x3F00
#define WM8904_FLL_OUTDIV(Value) (WM8904_FLL_OUTDIV_Msk & ((Value) << WM8904_FLL_OUTDIV_Pos))
#define WM8904_FLL_CTRL_RATE_Pos 4 /* FLL_CTRL_RATE - [6:4] */
#define WM8904_FLL_CTRL_RATE_Msk 0x0070
#define WM8904_FLL_CTRL_RATE(Value) (WM8904_FLL_CTRL_RATE_Msk & ((Value) << WM8904_FLL_CTRL_RATE_Pos))
#define WM8904_FLL_FRATIO_Pos 0 /* FLL_FRATIO - [2:0] */
#define WM8904_FLL_FRATIO_Msk 0x0007
#define WM8904_FLL_FRATIO(Value) (WM8904_FLL_FRATIO_Msk & ((Value) << WM8904_FLL_FRATIO_Pos))

/*
 * R118 (0x76) - FLL Control 3
 */
#define WM8904_R118_FLL_CONTROL_3 WM8904_FLL_CONTROL_3
#define WM8904_FLL_K_Pos 0 /* FLL_K - [15:0] */
#define WM8904_FLL_K_Msk 0xFFFF
#define WM8904_FLL_K(Value) (WM8904_FLL_K_Msk & ((Value) << WM8904_FLL_K_Pos))

/*
 * R119 (0x77) - FLL Control 4
 */
#define WM8904_R119_FLL_CONTROL_4 WM8904_FLL_CONTROL_4
#define WM8904_FLL_N_Pos 5 /* FLL_N - [14:5] */
#define WM8904_FLL_N_Msk 0x7FE0
#define WM8904_FLL_N(Value) (WM8904_FLL_N_Msk & ((Value) << WM8904_FLL_N_Pos))
#define WM8904_FLL_GAIN_Pos 0 /* FLL_GAIN - [3:0] */
#define WM8904_FLL_GAIN_Msk 0x000F
#define WM8904_FLL_GAIN(Value) (WM8904_FLL_GAIN_Msk & ((Value) << WM8904_FLL_GAIN_Pos))

/*
 * R120 (0x78) - FLL Control 5
 */
#define WM8904_R120_FLL_CONTROL_5 WM8904_FLL_CONTROL_5
#define WM8904_FLL_CLK_REF_DIV_Pos 3 /* FLL_CLK_REF_DIV - [4:3] */
#define WM8904_FLL_CLK_REF_DIV_Msk 0x0018
#define WM8904_FLL_CLK_REF_DIV(Value) (WM8904_FLL_CLK_REF_DIV_Msk & ((Value) << WM8904_FLL_CLK_REF_DIV_Pos))
#define WM8904_FLL_CLK_REF_SRC_Pos 0 /* FLL_CLK_REF_SRC - [1:0] */
#define WM8904_FLL_CLK_REF_SRC_Msk 0x0003
#define WM8904_FLL_CLK_REF_SRC(Value) (WM8904_FLL_CLK_REF_SRC_Msk & ((Value) << WM8904_FLL_CLK_REF_SRC_Pos))

