dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R121 (0x79) - GPIO Control 1
 */
#define WM8904_GPIO1_PU_Pos 5 /* GPIO1_PU */
#define WM8904_GPIO1_PU 0x0020
#define WM8904_GPIO1_PD_Pos 4 /* GPIO1_PD */
#define WM8904_GPIO1_PD 0x0010
#define WM8904_GPIO1_SEL_Pos 0 /* GPIO1_SEL - [3:0] */
#define WM8904_GPIO1_SEL_Msk 0x000F
#define WM8904_GPIO1_SEL(Value) (WM8904_GPIO1_SEL_Msk & ((Value) << WM8904_GPIO1_SEL_Pos))

/*
 * R122 (0x7A) - GPIO Control 2
 */
#define WM8904_GPIO2_PU_Pos 5 /* GPIO2_PU */
#define WM8904_GPIO2_PU 0x0020
#define WM8904_GPIO2_PD_Pos 4 /* GPIO2_PD */
#define WM8904_GPIO2_PD 0x0010
#define WM8904_GPIO2_SEL_Pos 0 /* GPIO2_SEL - [3:0] */
#define WM8904_GPIO2_SEL_Msk 0x000F
#define WM8904_GPIO2_SEL(Value) (WM8904_GPIO2_SEL_Msk & ((Value) << WM8904_GPIO2_SEL_Pos))

/*
 * R123 (0x7B) - GPIO Control 3
 */
#define WM8904_GPIO3_PU_Pos 5 /* GPIO3_PU */
#define WM8904_GPIO3_PU 0x0020
#define WM8904_GPIO3_PD_Pos 4 /* GPIO3_PD */
#define WM8904_GPIO3_PD 0x0010
#define WM8904_GPIO3_SEL_Pos 0 /* GPIO3_SEL - [3:0] */
#define WM8904_GPIO3_SEL_Msk 0x000F
#define WM8904_GPIO3_SEL(Value) (WM8904_GPIO3_SEL_Msk & ((Value) << WM8904_GPIO3_SEL_Pos))

/*
 * R124 (0x7C) - GPIO Control 4
 */
#define WM8904_GPI7_ENA_Pos 9 /* GPI7_ENA */
#define WM8904_GPI7_ENA 0x0200
#define WM8904_GPI8_ENA_Pos 8 /* GPI8_ENA */
#define WM8904_GPI8_ENA 0x0100
#define WM8904_GPIO_BCLK_MODE_ENA_Pos 7 /* GPIO_BCLK_MODE_ENA */
#define WM8904_GPIO_BCLK_MODE_ENA 0x0080
#define WM8904_GPIO_BCLK_SEL_Pos 0 /* GPIO_BCLK_SEL - [3:0] */
#define WM8904_GPIO_BCLK_SEL_Msk 0x000F
#define WM8904_GPIO_BCLK_SEL(Value) (WM8904_GPIO_BCLK_SEL_Msk & ((Value) << WM8904_GPIO_BCLK_SEL_Pos))

/*
 * R126 (0x7E) - Digital Pulls
 */
#define WM8904_MCLK_PU_Pos 7 /* MCLK_PU */
#define WM8904_MCLK_PU 0x0080
#define WM8904_MCLK_PD_Pos 6 /* MCLK_PD */
#define WM8904_MCLK_PD 0x0040
#define WM8904_DACDAT_PU_Pos 5 /* DACDAT_PU */
#define WM8904_DACDAT_PU 0x0020
#define WM8904_DACDAT_PD_Pos 4 /* DACDAT_PD */
#define WM8904_DACDAT_PD 0x0010
#define WM8904_LRCLK_PU_Pos 3 /* LRCLK_PU */
#define WM8904_LRCLK_PU 0x0008
#define WM8904_LRCLK_PD_Pos 2 /* LRCLK_PD */
#define WM8904_LRCLK_PD 0x0004
#define WM8904_BCLK_PU_Pos 1 /* BCLK_PU */
#define WM8904_BCLK_PU 0x0002
#define WM8904_BCLK_PD_Pos 0 /* BCLK_PD */
#define WM8904_BCLK_PD 0x0001

/*
 * R127 (0x7F) - Interrupt Status
 */
#define WM8904_IRQ_Pos 10 /* IRQ */
#define WM8904_IRQ 0x0400
#define WM8904_GPIO_BCLK_EINT_Pos 9 /* GPIO_BCLK_EINT */
#define WM8904_GPIO_BCLK_EINT 0x0200
#define WM8904_WSEQ_EINT_Pos 8 /* WSEQ_EINT */
#define WM8904_WSEQ_EINT 0x0100
#define WM8904_GPIO3_EINT_Pos 7 /* GPIO3_EINT */
#define WM8904_GPIO3_EINT 0x0080
#define WM8904_GPIO2_EINT_Pos 6 /* GPIO2_EINT */
#define WM8904_GPIO2_EINT 0x0040
#define WM8904_GPIO1_EINT_Pos 5 /* GPIO1_EINT */
#define WM8904_GPIO1_EINT 0x0020
#define WM8904_GPI8_EINT_Pos 4 /* GPI8_EINT */
#define WM8904_GPI8_EINT 0x0010
#define WM8904_GPI7_EINT_Pos 3 /* GPI7_EINT */
#define WM8904_GPI7_EINT 0x0008
#define WM8904_FLL_LOCK_EINT_Pos 2 /* FLL_LOCK_EINT */
#define WM8904_FLL_LOCK_EINT 0x0004
#define WM8904_MIC_SHRT_EINT_Pos 1 /* MIC_SHRT_EINT */
#define WM8904_MIC_SHRT_EINT 0x0002
#define WM8904_MIC_DET_EINT_Pos 0 /* MIC_DET_EINT */
#define WM8904_MIC_DET_EINT 0x0001

/*
 * R128 (0x80) - Interrupt Status Mask
 */
#define WM8904_IM_GPIO_BCLK_EINT_Pos 9 /* IM_GPIO_BCLK_EINT */
#define WM8904_IM_GPIO_BCLK_EINT 0x0200
#define WM8904_IM_WSEQ_EINT_Pos 8 /* IM_WSEQ_EINT */
#define WM8904_IM_WSEQ_EINT 0x0100
#define WM8904_IM_GPIO3_EINT_Pos 7 /* IM_GPIO3_EINT */
#define WM8904_IM_GPIO3_EINT 0x0080
#define WM8904_IM_GPIO2_EINT_Pos 6 /* IM_GPIO2_EINT */
#define WM8904_IM_GPIO2_EINT 0x0040
#define WM8904_IM_GPIO1_EINT_Pos 5 /* IM_GPIO1_EINT */
#define WM8904_IM_GPIO1_EINT 0x0020
#define WM8904_IM_GPI8_EINT_Pos 4 /* IM_GPI8_EINT */
#define WM8904_IM_GPI8_EINT 0x0010
#define WM8904_IM_GPI7_EINT_Pos 3 /* IM_GPI7_EINT */
#define WM8904_IM_GPI7_EINT 0x0008
#define WM8904_IM_FLL_LOCK_EINT_Pos 2 /* IM_FLL_LOCK_EINT */
#define WM8904_IM_FLL_LOCK_EINT 0x0004
#define WM8904_IM_MIC_SHRT_EINT_Pos 1 /* IM_MIC_SHRT_EINT */
#define WM8904_IM_MIC_SHRT_EINT 0x0002
#define WM8904_IM_MIC_DET_EINT_Pos 0 /* IM_MIC_DET_EINT */
#define WM8904_IM_MIC_DET_EINT 0x0001

/*
 * R129 (0x81) - Interrupt Polarity
 */
#define WM8904_GPIO_BCLK_EINT_POL_Pos 9 /* GPIO_BCLK_EINT_POL */
#define WM8904_GPIO_BCLK_EINT_POL 0x0200
#define WM8904_WSEQ_EINT_POL_Pos 8 /* WSEQ_EINT_POL */
#define WM8904_WSEQ_EINT_POL 0x0100
#define WM8904_GPIO3_EINT_POL_Pos 7 /* GPIO3_EINT_POL */
#define WM8904_GPIO3_EINT_POL 0x0080
#define WM8904_GPIO2_EINT_POL_Pos 6 /* GPIO2_EINT_POL */
#define WM8904_GPIO2_EINT_POL 0x0040
#define WM8904_GPIO1_EINT_POL_Pos 5 /* GPIO1_EINT_POL */
#define WM8904_GPIO1_EINT_POL 0x0020
#define WM8904_GPI8_EINT_POL_Pos 4 /* GPI8_EINT_POL */
#define WM8904_GPI8_EINT_POL 0x0010
#define WM8904_GPI7_EINT_POL_Pos 3 /* GPI7_EINT_POL */
#define WM8904_GPI7_EINT_POL 0x0008
#define WM8904_FLL_LOCK_EINT_POL_Pos 2 /* FLL_LOCK_EINT_POL */
#define WM8904_FLL_LOCK_EINT_POL 0x0004
#define WM8904_MIC_SHRT_EINT_POL_Pos 1 /* MIC_SHRT_EINT_POL */
#define WM8904_MIC_SHRT_EINT_POL 0x0002
#define WM8904_MIC_DET_EINT_POL_Pos 0 /* MIC_DET_EINT_POL */
#define WM8904_MIC_DET_EINT_POL 0x0001

/*
 * R130 (0x82) - Interrupt Debounce
 */
#define WM8904_GPIO_BCLK_EINT_DB_Pos 9 /* GPIO_BCLK_EINT_DB */
#define WM8904_GPIO_BCLK_EINT_DB 0x0200
#define WM8904_WSEQ_EINT_DB_Pos 8 /* WSEQ_EINT_DB */
#define WM8904_WSEQ_EINT_DB 0x0100
#define WM8904_GPIO3_EINT_DB_Pos 7 /* GPIO3_EINT_DB */
#define WM8904_GPIO3_EINT_DB 0x0080
#define WM8904_GPIO2_EINT_DB_Pos 6 /* GPIO2_EINT_DB */
#define WM8904_GPIO2_EINT_DB 0x0040
#define WM8904_GPIO1_EINT_DB_Pos 5 /* GPIO1_EINT_DB */
#define WM8904_GPIO1_EINT_DB 0x0020
#define WM8904_GPI8_EINT_DB_Pos 4 /* GPI8_EINT_DB */
#define WM8904_GPI8_EINT_DB 0x0010
#define WM8904_GPI7_EINT_DB_Pos 3 /* GPI7_EINT_DB */
#define WM8904_GPI7_EINT_DB 0x0008
#define WM8904_FLL_LOCK_EINT_DB_Pos 2 /* FLL_LOCK_EINT_DB */
#define WM8904_FLL_LOCK_EINT_DB 0x0004
#define WM8904_MIC_SHRT_EINT_DB_Pos 1 /* MIC_SHRT_EINT_DB */
#define WM8904_MIC_SHRT_EINT_DB 0x0002
#define WM8904_MIC_DET_EINT_DB_Pos 0 /* MIC_DET_EINT_DB */
#define WM8904_MIC_DET_EINT_DB 0x0001

