dennisppaul/klangstrom-arduino/libraries/Klangstrom_KLST_PANDA_STM32/src/WM8904.h
/*
 * R134 (0x86) - EQ1
 */
#define WM8904_EQ_ENA_Pos 0 /* EQ_ENA */
#define WM8904_EQ_ENA 0x0001

/*
 * R135 (0x87) - EQ2
 */
#define WM8904_EQ_B1_GAIN_Pos 0 /* EQ_B1_GAIN - [4:0] */
#define WM8904_EQ_B1_GAIN_Msk 0x001F
#define WM8904_EQ_B1_GAIN(Value) (WM8904_EQ_B1_GAIN_Msk & ((Value) << WM8904_EQ_B1_GAIN_Pos))

/*
 * R136 (0x88) - EQ3
 */
#define WM8904_EQ_B2_GAIN_Pos 0 /* EQ_B2_GAIN - [4:0] */
#define WM8904_EQ_B2_GAIN_Msk 0x001F
#define WM8904_EQ_B2_GAIN(Value) (WM8904_EQ_B2_GAIN_Msk & ((Value) << WM8904_EQ_B2_GAIN_Pos))

/*
 * R137 (0x89) - EQ4
 */
#define WM8904_EQ_B3_GAIN_Pos 0 /* EQ_B3_GAIN - [4:0] */
#define WM8904_EQ_B3_GAIN_Msk 0x001F
#define WM8904_EQ_B3_GAIN(Value) (WM8904_EQ_B3_GAIN_Msk & ((Value) << WM8904_EQ_B3_GAIN_Pos))

/*
 * R138 (0x8A) - EQ5
 */
#define WM8904_EQ_B4_GAIN_Pos 0 /* EQ_B4_GAIN - [4:0] */
#define WM8904_EQ_B4_GAIN_Msk 0x001F
#define WM8904_EQ_B4_GAIN(Value) (WM8904_EQ_B4_GAIN_Msk & ((Value) << WM8904_EQ_B4_GAIN_Pos))

/*
 * R139 (0x8B) - EQ6
 */
#define WM8904_EQ_B5_GAIN_Pos 0 /* EQ_B5_GAIN - [4:0] */
#define WM8904_EQ_B5_GAIN_Msk 0x001F
#define WM8904_EQ_B5_GAIN(Value) (WM8904_EQ_B5_GAIN_Msk & ((Value) << WM8904_EQ_B5_GAIN_Pos))

/*
 * R140 (0x8C) - EQ7
 */
#define WM8904_EQ_B1_A_Pos 0 /* EQ_B1_A - [15:0] */
#define WM8904_EQ_B1_A_Msk 0xFFFF
#define WM8904_EQ_B1_A(Value) (WM8904_EQ_B1_A_Msk & ((Value) << WM8904_EQ_B1_A_Pos))

/*
 * R141 (0x8D) - EQ8
 */
#define WM8904_EQ_B1_B_Pos 0 /* EQ_B1_B - [15:0] */
#define WM8904_EQ_B1_B_Msk 0xFFFF
#define WM8904_EQ_B1_B(Value) (WM8904_EQ_B1_B_Msk & ((Value) << WM8904_EQ_B1_B_Pos))

/*
 * R142 (0x8E) - EQ9
 */
#define WM8904_EQ_B1_PG_Pos 0 /* EQ_B1_PG - [15:0] */
#define WM8904_EQ_B1_PG_Msk 0xFFFF
#define WM8904_EQ_B1_PG(Value) (WM8904_EQ_B1_PG_Msk & ((Value) << WM8904_EQ_B1_PG_Pos))

/*
 * R143 (0x8F) - EQ10
 */
#define WM8904_EQ_B2_A_Pos 0 /* EQ_B2_A - [15:0] */
#define WM8904_EQ_B2_A_Msk 0xFFFF
#define WM8904_EQ_B2_A(Value) (WM8904_EQ_B2_A_Msk & ((Value) << WM8904_EQ_B2_A_Pos))

/*
 * R144 (0x90) - EQ11
 */
#define WM8904_EQ_B2_B_Pos 0 /* EQ_B2_B - [15:0] */
#define WM8904_EQ_B2_B_Msk 0xFFFF
#define WM8904_EQ_B2_B(Value) (WM8904_EQ_B2_B_Msk & ((Value) << WM8904_EQ_B2_B_Pos))

/*
 * R145 (0x91) - EQ12
 */
#define WM8904_EQ_B2_C_Pos 0 /* EQ_B2_C - [15:0] */
#define WM8904_EQ_B2_C_Msk 0xFFFF
#define WM8904_EQ_B2_C(Value) (WM8904_EQ_B2_C_Msk & ((Value) << WM8904_EQ_B2_C_Pos))

/*
 * R146 (0x92) - EQ13
 */
#define WM8904_EQ_B2_PG_Pos 0 /* EQ_B2_PG - [15:0] */
#define WM8904_EQ_B2_PG_Msk 0xFFFF
#define WM8904_EQ_B2_PG(Value) (WM8904_EQ_B2_PG_Msk & ((Value) << WM8904_EQ_B2_PG_Pos))

/*
 * R147 (0x93) - EQ14
 */
#define WM8904_EQ_B3_A_Pos 0 /* EQ_B3_A - [15:0] */
#define WM8904_EQ_B3_A_Msk 0xFFFF
#define WM8904_EQ_B3_A(Value) (WM8904_EQ_B3_A_Msk & ((Value) << WM8904_EQ_B3_A_Pos))

/*
 * R148 (0x94) - EQ15
 */
#define WM8904_EQ_B3_B_Pos 0 /* EQ_B3_B - [15:0] */
#define WM8904_EQ_B3_B_Msk 0xFFFF
#define WM8904_EQ_B3_B(Value) (WM8904_EQ_B3_B_Msk & ((Value) << WM8904_EQ_B3_B_Pos))

/*
 * R149 (0x95) - EQ16
 */
#define WM8904_EQ_B3_C_Pos 0 /* EQ_B3_C - [15:0] */
#define WM8904_EQ_B3_C_Msk 0xFFFF
#define WM8904_EQ_B3_C(Value) (WM8904_EQ_B3_C_Msk & ((Value) << WM8904_EQ_B3_C_Pos))

/*
 * R150 (0x96) - EQ17
 */
#define WM8904_EQ_B3_PG_Pos 0 /* EQ_B3_PG - [15:0] */
#define WM8904_EQ_B3_PG_Msk 0xFFFF
#define WM8904_EQ_B3_PG(Value) (WM8904_EQ_B3_PG_Msk & ((Value) << WM8904_EQ_B3_PG_Pos))

/*
 * R151 (0x97) - EQ18
 */
#define WM8904_EQ_B4_A_Pos 0 /* EQ_B4_A - [15:0] */
#define WM8904_EQ_B4_A_Msk 0xFFFF
#define WM8904_EQ_B4_A(Value) (WM8904_EQ_B4_A_Msk & ((Value) << WM8904_EQ_B4_A_Pos))

/*
 * R152 (0x98) - EQ19
 */
#define WM8904_EQ_B4_B_Pos 0 /* EQ_B4_B - [15:0] */
#define WM8904_EQ_B4_B_Msk 0xFFFF
#define WM8904_EQ_B4_B(Value) (WM8904_EQ_B4_B_Msk & ((Value) << WM8904_EQ_B4_B_Pos))

/*
 * R153 (0x99) - EQ20
 */
#define WM8904_EQ_B4_C_Pos 0 /* EQ_B4_C - [15:0] */
#define WM8904_EQ_B4_C_Msk 0xFFFF
#define WM8904_EQ_B4_C(Value) (WM8904_EQ_B4_C_Msk & ((Value) << WM8904_EQ_B4_C_Pos))

/*
 * R154 (0x9A) - EQ21
 */
#define WM8904_EQ_B4_PG_Pos 0 /* EQ_B4_PG - [15:0] */
#define WM8904_EQ_B4_PG_Msk 0xFFFF
#define WM8904_EQ_B4_PG(Value) (WM8904_EQ_B4_PG_Msk & ((Value) << WM8904_EQ_B4_PG_Pos))

/*
 * R155 (0x9B) - EQ22
 */
#define WM8904_EQ_B5_A_Pos 0 /* EQ_B5_A - [15:0] */
#define WM8904_EQ_B5_A_Msk 0xFFFF
#define WM8904_EQ_B5_A(Value) (WM8904_EQ_B5_A_Msk & ((Value) << WM8904_EQ_B5_A_Pos))

/*
 * R156 (0x9C) - EQ23
 */
#define WM8904_EQ_B5_B_Pos 0 /* EQ_B5_B - [15:0] */
#define WM8904_EQ_B5_B_Msk 0xFFFF
#define WM8904_EQ_B5_B(Value) (WM8904_EQ_B5_B_Msk & ((Value) << WM8904_EQ_B5_B_Pos))

/*
 * R157 (0x9D) - EQ24
 */
#define WM8904_EQ_B5_PG_Pos 0 /* EQ_B5_PG - [15:0] */
#define WM8904_EQ_B5_PG_Msk 0xFFFF
#define WM8904_EQ_B5_PG(Value) (WM8904_EQ_B5_PG_Msk & ((Value) << WM8904_EQ_B5_PG_Pos))

/*
 * R198 (0xC6) - ADC Test 0
 */
#define WM8904_ADC_128_OSR_TST_MODE_Pos 2 /* ADC_128_OSR_TST_MODE */
#define WM8904_ADC_128_OSR_TST_MODE 0x0004
#define WM8904_ADC_BIASX1P5_Pos 0 /* ADC_BIASX1P5 */
#define WM8904_ADC_BIASX1P5 0x0001

/*
 * R247 (0xF7) - FLL NCO Test 0
 */
#define WM8904_FLL_FRC_NCO_Pos 0 /* FLL_FRC_NCO */
#define WM8904_FLL_FRC_NCO 0x0001

/*
 * R248 (0xF8) - FLL NCO Test 1
 */
#define WM8904_FLL_FRC_NCO_VAL_Pos 0 /* FLL_FRC_NCO_VAL - [5:0] */
#define WM8904_FLL_FRC_NCO_VAL_Msk 0x003F
#define WM8904_FLL_FRC_NCO_VAL(Value) (WM8904_FLL_FRC_NCO_VAL_Msk & ((Value) << WM8904_FLL_FRC_NCO_VAL_Pos))

uint8_t  WM8904_write_register(uint8_t uc_register_address, uint16_t us_data);
uint16_t WM8904_read_register(uint8_t uc_register_address);
uint32_t WM8904_init(I2C_HandleTypeDef* hi2c_handle);
uint8_t  WM8904_toggle_flag(uint8_t register_address, uint16_t flag_bit);
uint8_t  WM8904_set_flag(uint8_t register_address, uint16_t flag_bit, uint8_t flag_state);

#ifdef __cplusplus
}
#endif

#endif // KLST_PERIPHERAL_ENABLE_AUDIODEVICE
#endif // KLST_PANDA_STM32
